In [1]:
import pandas as pd
from ast import literal_eval

In [2]:
data = pd.read_csv('tmdb_5000_movies.csv')

In [3]:
data = data[['id', 'genres', 'keywords', 'title']]
data.head(2)

,id,genres,keywords,title
0,19995,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...","[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",Avatar
1,285,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 14, ""...","[{""id"": 270, ""name"": ""ocean""}, {""id"": 726, ""na...",Pirates of the Caribbean: At World's End

In [4]:
data['genres'] = data['genres'].apply(literal_eval)
data['keywords'] = data['keywords'].apply(literal_eval)
data.head(2)

,id,genres,keywords,title
0,19995,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...","[{'id': 1463, 'name': 'culture clash'}, {'id':...",Avatar
1,285,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...","[{'id': 270, 'name': 'ocean'}, {'id': 726, 'na...",Pirates of the Caribbean: At World's End

In [5]:
data['genres'] = data['genres'].apply(lambda x : [d['name'] for d in x]).apply(lambda x : " ".join(x))
data['keywords'] = data['keywords'].apply(lambda x : [d['name'] for d in x]).apply(lambda x : " ".join(x))
data.head(2)

,id,genres,keywords,title
0,19995,Action Adventure Fantasy Science Fiction,culture clash future space war space colony so...,Avatar
1,285,Adventure Fantasy Action,ocean drug abuse exotic island east india trad...,Pirates of the Caribbean: At World's End

In [6]:
from sklearn.feature_extraction.text import CountVectorizer

cv = CountVectorizer()
c_vector_genres = cv.fit_transform(data['genres'])

In [7]:
print(f'CountVectorizer가 찾은 장르 갯수: {len(cv.get_feature_names())}')

CountVectorizer가 찾은 장르 갯수: 22

In [8]:
c_vector_genres.toarray()

array([[1, 1, 0, ..., 0, 0, 0],
       [1, 1, 0, ..., 0, 0, 0],
       [1, 1, 0, ..., 0, 0, 0],
       ...,
       [0, 0, 0, ..., 1, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0]], dtype=int64)

In [9]:
# 4803개의 영화, 22개의 장르
c_vector_genres.shape

(4803, 22)

In [13]:
from sklearn.metrics.pairwise import cosine_similarity
similartiy_matrix = cosine_similarity(c_vector_genres, c_vector_genres)

In [14]:
similartiy_matrix

array([[1.        , 0.77459667, 0.51639778, ..., 0.        , 0.        ,
        0.        ],
       [0.77459667, 1.        , 0.66666667, ..., 0.        , 0.        ,
        0.        ],
       [0.51639778, 0.66666667, 1.        , ..., 0.        , 0.        ,
        0.        ],
       ...,
       [0.        , 0.        , 0.        , ..., 1.        , 0.        ,
        0.        ],
       [0.        , 0.        , 0.        , ..., 0.        , 0.        ,
        0.        ],
       [0.        , 0.        , 0.        , ..., 0.        , 0.        ,
        1.        ]])

In [15]:
similartiy_matrix.shape

(4803, 4803)

In [ ]:
def get_recommend_movie_list(df, movie_title, top=30):

In [ ]:
def